---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange.BoltDiameter
source: html/0f0e4d89-5aaa-0527-21c1-455ffdf058cc.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCSlopedFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```